avr-rust/avrd/packs/xmegad/ATxmega192D3.atdf
      <value-group caption="Virtual Port 2 Mapping" name="PORTCFG_VP2MAP">
        <value caption="Mapped To PORTA" name="PORTA" value="0x00"/>
        <value caption="Mapped To PORTB" name="PORTB" value="0x01"/>
        <value caption="Mapped To PORTC" name="PORTC" value="0x02"/>
        <value caption="Mapped To PORTD" name="PORTD" value="0x03"/>
        <value caption="Mapped To PORTE" name="PORTE" value="0x04"/>
        <value caption="Mapped To PORTF" name="PORTF" value="0x05"/>
        <value caption="Mapped To PORTG" name="PORTG" value="0x06"/>
        <value caption="Mapped To PORTH" name="PORTH" value="0x07"/>
        <value caption="Mapped To PORTJ" name="PORTJ" value="0x08"/>
        <value caption="Mapped To PORTK" name="PORTK" value="0x09"/>
        <value caption="Mapped To PORTL" name="PORTL" value="0x0A"/>
        <value caption="Mapped To PORTM" name="PORTM" value="0x0B"/>
        <value caption="Mapped To PORTN" name="PORTN" value="0x0C"/>
        <value caption="Mapped To PORTP" name="PORTP" value="0x0D"/>
        <value caption="Mapped To PORTQ" name="PORTQ" value="0x0E"/>
        <value caption="Mapped To PORTR" name="PORTR" value="0x0F"/>
      </value-group>
      <value-group caption="Virtual Port 3 Mapping" name="PORTCFG_VP3MAP">
        <value caption="Mapped To PORTA" name="PORTA" value="0x00"/>
        <value caption="Mapped To PORTB" name="PORTB" value="0x01"/>
        <value caption="Mapped To PORTC" name="PORTC" value="0x02"/>
        <value caption="Mapped To PORTD" name="PORTD" value="0x03"/>
        <value caption="Mapped To PORTE" name="PORTE" value="0x04"/>
        <value caption="Mapped To PORTF" name="PORTF" value="0x05"/>
        <value caption="Mapped To PORTG" name="PORTG" value="0x06"/>
        <value caption="Mapped To PORTH" name="PORTH" value="0x07"/>
        <value caption="Mapped To PORTJ" name="PORTJ" value="0x08"/>
        <value caption="Mapped To PORTK" name="PORTK" value="0x09"/>
        <value caption="Mapped To PORTL" name="PORTL" value="0x0A"/>
        <value caption="Mapped To PORTM" name="PORTM" value="0x0B"/>
        <value caption="Mapped To PORTN" name="PORTN" value="0x0C"/>
        <value caption="Mapped To PORTP" name="PORTP" value="0x0D"/>
        <value caption="Mapped To PORTQ" name="PORTQ" value="0x0E"/>
        <value caption="Mapped To PORTR" name="PORTR" value="0x0F"/>
      </value-group>
      <value-group caption="Clock Output Port" name="PORTCFG_CLKOUT">
        <value caption="Clock Output Disabled" name="OFF" value="0x00"/>
        <value caption="Clock Output on Port C pin 7" name="PC7" value="0x01"/>
        <value caption="Clock Output on Port D pin 7" name="PD7" value="0x02"/>
        <value caption="Clock Output on Port E pin 7" name="PE7" value="0x03"/>
      </value-group>
      <value-group caption="Event Output Port" name="PORTCFG_EVOUT">
        <value caption="Event Output Disabled" name="OFF" value="0x00"/>
        <value caption="Event Channel 7 Output on Port C pin 7" name="PC7" value="0x01"/>
        <value caption="Event Channel 7 Output on Port D pin 7" name="PD7" value="0x02"/>
        <value caption="Event Channel 7 Output on Port E pin 7" name="PE7" value="0x03"/>
      </value-group>
      <value-group caption="Port Interrupt 0 Level" name="PORT_INT0LVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Port Interrupt 1 Level" name="PORT_INT1LVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Output/Pull Configuration" name="PORT_OPC">
        <value caption="Totempole" name="TOTEM" value="0x00"/>
        <value caption="Totempole w/ Bus keeper on Input and Output" name="BUSKEEPER" value="0x01"/>
        <value caption="Totempole w/ Pull-down on Input" name="PULLDOWN" value="0x02"/>
        <value caption="Totempole w/ Pull-up on Input" name="PULLUP" value="0x03"/>
        <value caption="Wired OR" name="WIREDOR" value="0x04"/>
        <value caption="Wired AND" name="WIREDAND" value="0x05"/>
        <value caption="Wired OR w/ Pull-down" name="WIREDORPULL" value="0x06"/>
        <value caption="Wired AND w/ Pull-up" name="WIREDANDPULL" value="0x07"/>
      </value-group>
      <value-group caption="Input/Sense Configuration" name="PORT_ISC">
        <value caption="Sense Both Edges" name="BOTHEDGES" value="0x00"/>
        <value caption="Sense Rising Edge" name="RISING" value="0x01"/>
        <value caption="Sense Falling Edge" name="FALLING" value="0x02"/>
        <value caption="Sense Level (Transparent For Events)" name="LEVEL" value="0x03"/>
        <value caption="Disable Digital Input Buffer" name="INPUT_DISABLE" value="0x07"/>
      </value-group>
      <interrupt-group name="PORT">
        <interrupt index="0" name="INT0" caption="External Interrupt 0"/>
        <interrupt index="1" name="INT1" caption="External Interrupt 1"/>
      </interrupt-group>
    </module>
    <module name="TC" id="I6090" caption="16-bit Timer/Counter With PWM">
      <register-group caption="16-bit Timer/Counter 0" name="TC0" size="64">
        <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Clock Selection" mask="0x0F" name="CLKSEL" values="TC_CLKSEL"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Compare or Capture D Enable" mask="0x80" name="CCDEN"/>
          <bitfield caption="Compare or Capture C Enable" mask="0x40" name="CCCEN"/>
          <bitfield caption="Compare or Capture B Enable" mask="0x20" name="CCBEN"/>
          <bitfield caption="Compare or Capture A Enable" mask="0x10" name="CCAEN"/>
          <bitfield caption="Waveform generation mode" mask="0x07" name="WGMODE" values="TC_WGMODE"/>
        </register>
